In [31]:
import pandas as pd
import numpy as np

In [32]:
df = pd.read_csv("people.csv")
df.head(3)

      Name  Age         City
0    Alice   35     New York
1      Bob   28  Los Angeles
2  Charlie   42      Chicago

In [33]:
#droping index and seting Name to new index
df = df.set_index('Name', drop=True)

In [34]:
#result
df.head(3)

         Age         City
Name
Alice     35     New York
Bob       28  Los Angeles
Charlie   42      Chicago

In [35]:
#sorting ascending
df.sort_values(by='Name', ascending=True, inplace=True)
df.head(3)

         Age    City
Name
Abigail   35  Austin
Abigail   31  Austin
Abigail   39  Denver

In [36]:
#sorting descending
df.sort_values(by='Name', ascending=False, inplace=True)
df.reset_index(drop=False, inplace=True)

df.head(3)

      Name  Age           City
0  William   32  San Francisco
1  William   36         Denver
2  William   41        Seattle

In [37]:
#Create a new df without Abigail
df2 = df[df.index != 'Abigail']
df2.sort_values(by='Name', ascending=True, inplace=True)
df2.head(3)

        Name  Age    City
116  Abigail   35  Austin
113  Abigail   39  Denver
115  Abigail   39  Denver

In [38]:
#Find all Abigails that are 35
df3 = df[(df['Name'] == 'Abigail') & (df['Age'] == 35)]

df3.head()

        Name  Age    City
116  Abigail   35  Austin

In [39]:
#checking for how many dublicates there are
num_duplicate_rows = df.duplicated().sum()
num_duplicate_rows

1

In [40]:
#dropping dublicates
df = df.drop_duplicates()

In [41]:
#find uniqes
df['Name'].unique()

array(['William', 'Sophie', 'Sophia', 'Sofia', 'Scarlett', 'Samuel',
       'Olivia', 'Oliver', 'Michael', 'Mia', 'Matthew', 'Mason', 'Lucy',
       'Lucas', 'Lily', 'Liam', 'James', 'Jacob', 'Jack', 'Isaac',
       'Henry', 'Harper', 'Hannah', 'Grace', 'George', 'Fiona', 'Evelyn',
       'Eva', 'Ethan', 'Emma', 'Emily', 'Ella', 'Eleanor', 'David',
       'Daniel', 'Chloe', 'Charlotte', 'Charlie', 'Bob', 'Benjamin',
       'Ava', 'Amelia', 'Alice', 'Alexander', 'Aiden', 'Abigail'],
      dtype=object)

In [42]:
#print heads
for col in df.columns:
    print(col)

Name
Age
City

In [43]:
#Find all Austin residents that are 30
df4 = df[(df['City'] == 'Austin') & (df['Age'] == 30)]

df4.head()

    Name  Age    City
45  Liam   30  Austin

In [44]:
df_austin = df[df['City'] == 'Austin']
means = df_austin['Age'].mean()
print(f'The average age is: {means}')

The average age is: 32.333333333333336

In [45]:
#random salary
df5 = df
df5['Salary'] = np.random.randint(20000, 35001, df5.shape[0])
df5.head(3)

      Name  Age           City  Salary
0  William   32  San Francisco   33986
1  William   36         Denver   23464
2  William   41        Seattle   20202

In [46]:
#count and display
df6 = df5.groupby('City').count()
df6['Name']

City
Austin           12
Boston           12
Chicago          11
Denver           11
Houston          14
Los Angeles      11
Miami            12
New York         11
San Francisco    12
Seattle          10
Name: Name, dtype: int64

In [47]:
#all city-names, how many people live in each city and the average age for each city
#since we did the first part above we steal that first
df6['Total Residents'] = df6['Name']
#Then group by city and calculate mean
df6['Average age'] = df.groupby('City')['Age'].mean()
#then drop redundant values
df6 = df6.drop(['Name','Age','Salary'], axis=1)

In [48]:
#See the results
df6.head(3)

         Total Residents  Average age
City
Austin                12    32.333333
Boston                12    32.500000
Chicago               11    34.636364

In [49]:
df6.to_json('lines_true.json',lines=True, orient = 'records', compression = 'infer')

In [50]:
df6.to_json('lines_false.json',lines=False, orient = 'records', compression = 'infer')

In [51]:
#Read the json file
df_people2 = pd.read_json("people.json")
df_people2.head(2)

    Name  Age          City
0  Alice   35  Philadelphia
1    Bob   78     San Diego

In [52]:
#concat the 2 dataframes and ignore index
df_result = pd.concat([df, df_people2], ignore_index=True)

In [53]:
#change space to -
df_result['City'] = df_result['City'].str.replace(" ", "-")
df_result.head(2)

      Name  Age           City   Salary
0  William   32  San-Francisco  33986.0
1  William   36         Denver  23464.0

In [54]:
#Read the salary df
salary_df = pd.DataFrame({'Salary' : [50000, 60000, 70000, 80000]}, index=[0,1,2,3])
#merge the 2 dataframes
merged_df = df_result.merge(salary_df, left_index=True, right_index=True, how='left')

merged_df.head(8)

      Name  Age           City  Salary_x  Salary_y
0  William   32  San-Francisco   33986.0   50000.0
1  William   36         Denver   23464.0   60000.0
2  William   41        Seattle   20202.0   70000.0
3  William   25         Boston   31252.0   80000.0
4   Sophie   33          Miami   26638.0       NaN
5   Sophie   37        Houston   33050.0       NaN
6   Sophie   28        Houston   33517.0       NaN
7   Sophia   27       New-York   24108.0       NaN